Documents/РасходДСПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходДСПлан</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ИзППМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ОтветственныйПрораб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОД_ЖурналДействийСогласовний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОД_ЖурналДействийСогласовний</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОД_СостоянияСчетовНаОплатуОтПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ОД_СостоянияСчетовНаОплатуОтПоставщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходДСПлан/Ext/ObjectModule.bsl
&Перед("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ЭтотОбъект.ОД_ИзППМ = ДанныеЗаполнения.ОД_ИзППМ;
		Если ДанныеЗаполнения.ОД_Состояние <> Перечисления.ОД_СостоянияСчетовНаОплатуОтПоставщиков.Согласован Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ЭтотОбъект.ОД_ИзППМ = ДанныеЗаполнения.ОД_ИзППМ;
		Если ДанныеЗаполнения.СостояниеЗаказа <> Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("Согласован") Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&После("ПередЗаписью")
Процедура ОД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда	
		
		ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Истина); 
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходДСПлан.СтатусУтвержденияПлатежа КАК СтатусУтвержденияПлатежа
			|ИЗ
			|	Документ.РасходДСПлан КАК РасходДСПлан
			|ГДЕ
			|	РасходДСПлан.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если ВыборкаДетальныеЗаписи.СтатусУтвержденияПлатежа <> ЭтотОбъект.СтатусУтвержденияПлатежа Тогда
				ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Ложь);	
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(НовыйДокумент)

	НаборЗаписей = РегистрыСведений.ОД_ЖурналДействийСогласовний.СоздатьМенеджерЗаписи(); 

	НаборЗаписей.Период = ТекущаяДата();
	НаборЗаписей. Дата = ТекущаяДата(); 
	НаборЗаписей.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если НовыйДокумент Тогда  
		ЭтотОбъект.УстановитьСсылкуНового(Документы.РасходДСПлан.ПолучитьСсылку());	
		НаборЗаписей.Документ = ПолучитьСсылкуНового();	
	Иначе
		НаборЗаписей.Документ = ЭтотОбъект.Ссылка;	
	КонецЕсли;	 
	
	Если ЭтотОбъект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
		НаборЗаписей.СтатусСогласования = "Утвержден";		
	ИначеЕсли ЭтотОбъект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден Тогда
		НаборЗаписей.СтатусСогласования = "Не утвержден";	
	КонецЕсли;
		

	НаборЗаписей.Записать();
	
КонецПроцедуры
